styles01/StackChan-OpenClaw-Hermes/rosie-node/sdkconfig.defaults
# Rosie Node — CoreS3 (M5Stack Stack-chan) sdkconfig defaults
# Based on Waveshare room-node defaults + CoreS3 hardware config

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash + partitions (dual-OTA with rollback)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# PSRAM (CoreS3 has 8MB octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# TLS
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y

# Wake word — stock "Hi ESP" model for now (Phase 3 will swap)
CONFIG_SR_WN_WN9_HIESP=y

# LVGL fonts for the procedural face
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_DRAW_BUF_ALIGN=16
CONFIG_LV_DEF_REFR_PERIOD=16

# PSRAM-first memory policy (matches esp-webrtc-solution demos)
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Console on USB Serial/JTAG (NOT UART0 — UART1 is for servos)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Node task priorities (must be above audio encoder workers, below capture/peer)
CONFIG_ESP_OPENCLAW_NODE_TASK_STACK_SIZE=8192
CONFIG_ESP_OPENCLAW_NODE_TRANSPORT_TASK_STACK_SIZE=8192
CONFIG_ESP_OPENCLAW_NODE_TASK_PRIORITY=11
CONFIG_ESP_OPENCLAW_NODE_TRANSPORT_TASK_PRIORITY=11